src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Линейки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция ПолучитьКаталогСхем()
Возврат(Константы.КаталогДокументовИПрограмм.Получить()+"СхемыЛинеек\"+Константы.КодБазы.Получить());
КонецФункции

&НаСервере
Функция ПолучитьЦвет()
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
	Возврат(ЗначениеИзСтрокиВнутр(Объект.Цвет));
	Иначе
	Возврат("");
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Попытка
    КОМОбъект = Новый COMОбъект ("WScript.Network");
    Принтеры = КОМОбъект.EnumPrinterConnections();
    к = 0;
        Пока к < Принтеры.Count()-1 Цикл
        СписокПринтеров.Добавить(Принтеры.Item(к+1), Принтеры.Item(к+1));
        к = к + 2;
        КонецЦикла;
    Исключение
    Сообщить(ОписаниеОшибки());
    КонецПопытки;
		Попытка
		СхемаЛинейки.Прочитать(ПолучитьКаталогСхем()+СокрЛП(Объект.Наименование)+".grs");
		Исключение
		
		КонецПопытки;
Цвет = ПолучитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ПринтерыПринтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ЭлементСписка = СписокПринтеров.ВыбратьЭлемент("Выберите принтер",ЭлементСписка);
ПринтерыПринтерОбработкаВыбора(Элемент, ЭлементСписка.Значение, Истина);  
КонецПроцедуры

&НаКлиенте
Процедура ПринтерыПринтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
Элементы.Принтеры.ТекущиеДанные.Принтер = ВыбранноеЗначение;
КонецПроцедуры

&НаСервере
Функция ЦветВСтрокуВнутр()
Возврат(ЗначениеВСтрокуВнутр(Цвет));
КонецФункции

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
Объект.Цвет = ЦветВСтрокуВнутр();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ВидЛинейки = Перечисления.ВидыЛинеек.Канбан Тогда
		Если Объект.ВидыКанбанов.Количество() = 0 Тогда
		Отказ =  Истина;
		Сообщить("Не заполнены виды канбанов!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
